AWorksOpen/aw_m1052/aworks_sdk/source/imxrt10xx_common/board/imxrt105x/cpu/include/driver/flexspi/imx1050_flexspi_regs.h
/*******************************************************************************
*                                 AWorks
*                       ----------------------------
*                       innovating embedded platform
*
* Copyright (c) 2001-2017 Guangzhou ZHIYUAN Electronics Co., Ltd.
* All rights reserved.
*
* Contact information:
* web site:    http://www.zlg.cn/
*******************************************************************************/
/**
 * \file
 * \brief iMX RT1050 FlexSPI regs
 *
 * \internal
 * \par modification history:
 * - 1.00 17-10-27  mex, first implementation
 * \endinternal
 */

#ifndef __IMX1050_FLEXSPI_REGS_H
#define __IMX1050_FLEXSPI_REGS_H

#include "stdint.h"

#define __IO  volatile
#define __O   volatile
#define __I   volatile const

typedef struct {

  __IO uint32_t MCR0;                  /**< \brief Module Control Register 0, offset: 0x0 */
  __IO uint32_t MCR1;                  /**< \brief Module Control Register 1, offset: 0x4 */
  __IO uint32_t MCR2;                  /**< \brief Module Control Register 2, offset: 0x8 */
  __IO uint32_t AHBCR;                 /**< \brief AHB Bus Control Register, offset: 0xC */
  __IO uint32_t INTEN;                 /**< \brief Interrupt Enable Register, offset: 0x10 */
  __IO uint32_t INTR;                  /**< \brief Interrupt Register, offset: 0x14 */
  __IO uint32_t LUTKEY;                /**< \brief LUT Key Register, offset: 0x18 */
  __IO uint32_t LUTCR;                 /**< \brief LUT Control Register, offset: 0x1C */
  __IO uint32_t AHBRXBUFCR0[4];        /**< \brief AHB RX Buffer 0 Control Register 0..AHB RX Buffer 3 Control Register 0, array offset: 0x20, array step: 0x4 */
       uint8_t RESERVED_0[48];
  __IO uint32_t FLSHCR0[4];            /**< \brief Flash A1 Control Register 0..Flash B2 Control Register 0, array offset: 0x60, array step: 0x4 */
  __IO uint32_t FLSHCR1[4];            /**< \brief Flash A1 Control Register 1..Flash B2 Control Register 1, array offset: 0x70, array step: 0x4 */
  __IO uint32_t FLSHCR2[4];            /**< \brief Flash A1 Control Register 2..Flash B2 Control Register 2, array offset: 0x80, array step: 0x4 */
       uint8_t RESERVED_1[16];
  __IO uint32_t IPCR0;                 /**< \brief IP Control Register 0, offset: 0xA0 */
  __IO uint32_t IPCR1;                 /**< \brief IP Control Register 1, offset: 0xA4 */
       uint8_t RESERVED_2[8];
  __IO uint32_t IPCMD;                 /**< \brief IP Command Register, offset: 0xB0 */
  __IO uint32_t DLPR;                  /**< \brief Data Learn Pattern Register, offset: 0xB4 */
  __IO uint32_t IPRXFCR;               /**< \brief IP RX FIFO Control Register, offset: 0xB8 */
  __IO uint32_t IPTXFCR;               /**< \brief IP TX FIFO Control Register, offset: 0xBC */
  __IO uint32_t DLLCR[2];              /**< \brief DLL Control Register 0, array offset: 0xC0, array step: 0x4 */
       uint8_t RESERVED_3[24];
  __I  uint32_t STS0;                  /**< \brief Status Register 0, offset: 0xE0 */
  __I  uint32_t STS1;                  /**< \brief Status Register 1, offset: 0xE4 */
  __I  uint32_t STS2;                  /**< \brief Status Register 2, offset: 0xE8 */
  __I  uint32_t AHBSPNDSTS;            /**< \brief AHB Suspend Status Register, offset: 0xEC */
  __I  uint32_t IPRXFSTS;              /**< \brief IP RX FIFO Status Register, offset: 0xF0 */
  __I  uint32_t IPTXFSTS;              /**< \brief IP TX FIFO Status Register, offset: 0xF4 */
       uint8_t RESERVED_4[8];
  __I  uint32_t RFDR[32];              /**< \brief IP RX FIFO Data Register 0..IP RX FIFO Data Register 31, array offset: 0x100, array step: 0x4 */
  __O  uint32_t TFDR[32];              /**< \brief IP TX FIFO Data Register 0..IP TX FIFO Data Register 31, array offset: 0x180, array step: 0x4 */
  __IO uint32_t LUT[64];               /**< \brief LUT 0..LUT 63, array offset: 0x200, array step: 0x4 */

} imx1050_flexspi_regs_t;


/**
 * \brief 命令类型
 */
typedef enum __flexspi_command_type
{
    flexspi_command,    /** \brief 写命令操作 */
    flexspi_config,     /** \brief 配置设备操作 */
    flexspi_read,       /** \brief 读操作 */
    flexspi_write,      /** \brief 写操作 */
} flexspi_command_type_t;


/**
 * \brief FLEXSPI AHB写等待间隔时间单元
 */
typedef enum __flexspi_ahb_write_wait_unit
{
    AhbWriteWaitUnit2AhbCycle = 0x0UL,      /**< \brief AWRWAIT unit is 2 ahb clock cycle. */
    AhbWriteWaitUnit8AhbCycle = 0x1UL,      /**< \brief AWRWAIT unit is 8 ahb clock cycle. */
    AhbWriteWaitUnit32AhbCycle = 0x2UL,     /**< \brief AWRWAIT unit is 32 ahb clock cycle. */
    AhbWriteWaitUnit128AhbCycle = 0x3UL,    /**< \brief AWRWAIT unit is 128 ahb clock cycle. */
    AhbWriteWaitUnit512AhbCycle = 0x4UL,    /**< \brief AWRWAIT unit is 512 ahb clock cycle. */
    AhbWriteWaitUnit2048AhbCycle = 0x5UL,   /**< \brief AWRWAIT unit is 2048 ahb clock cycle. */
    AhbWriteWaitUnit8192AhbCycle = 0x6UL,   /**< \brief AWRWAIT unit is 8192 ahb clock cycle. */
    AhbWriteWaitUnit32768AhbCycle = 0x7UL,  /**< \brief AWRWAIT unit is 32768 ahb clock cycle. */
} flexspi_ahb_write_wait_unit_t;


/*******************************************************************************
  Module Control Register 0
*******************************************************************************/

/* Software Reset bit */
#define __FLEXSPI_MCR0_SWRESET_SHIFT                0
#define __FLEXSPI_MCR0_SWRESET_MASK                (0x1 << __FLEXSPI_MCR0_SWRESET_SHIFT)

/* Module Disable bit */
#define __FLEXSPI_MCR0_MDIS_SHIFT                   1
#define __FLEXSPI_MCR0_MDIS_MASK                   (0x1 << __FLEXSPI_MCR0_MDIS_SHIFT)

/* Sample Clock source selection for Flash Reading */
#define __FLEXSPI_MCR0_RXCLKSRC_SHIFT               4
#define __FLEXSPI_MCR0_RXCLKSRC(x)                 (((x) & 0x03) << __FLEXSPI_MCR0_RXCLKSRC_SHIFT)

/* Enable AHB bus Read Access to IP RX FIFO */
#define __FLEXSPI_MCR0_ARDFEN_SHIFT                 6
#define __FLEXSPI_MCR0_ARDFEN(x)                   (((x) & 0x01) << __FLEXSPI_MCR0_ARDFEN_SHIFT)

